<?php

namespace Biuio\Meter\dlt645;

use Biuio\Meter\dlt645;
use Biuio\Meter\lib\tool;

/**
 * 表A.1 电能表数据标识编码表
 */
class di3_00 extends di3
{
    const RATES_DI1 = [
        "总电能" => "00",
        "费率1电能" => "01",
        "费率2电能" => "02",
        "费率3电能" => "03",
        "费率4电能" => "04",
        "费率5电能" => "05",
        "费率6电能" => "06",
        "费率7电能" => "07",
        "费率8电能" => "08",
        "费率9电能" => "09",
        "费率10电能" => "0A",
        "费率11电能" => "0B",
        "费率12电能" => "0C",
        "费率13电能" => "0D",
        "费率14电能" => "0E",
        "费率15电能" => "0F",
        "费率16电能" => "10",
        "费率17电能" => "11",
        "费率18电能" => "12",
        "费率19电能" => "13",
        "费率20电能" => "14",
        "费率21电能" => "15",
        "费率22电能" => "16",
        "费率23电能" => "17",
        "费率24电能" => "18",
        "费率25电能" => "19",
        "费率26电能" => "1A",
        "费率27电能" => "1B",
        "费率28电能" => "1C",
        "费率29电能" => "1D",
        "费率30电能" => "1E",
        "费率31电能" => "1F",
        "费率32电能" => "20",
        "费率33电能" => "21",
        "费率34电能" => "22",
        "费率35电能" => "23",
        "费率36电能" => "24",
        "费率37电能" => "25",
        "费率38电能" => "26",
        "费率39电能" => "27",
        "费率40电能" => "28",
        "费率41电能" => "29",
        "费率42电能" => "2A",
        "费率43电能" => "2B",
        "费率44电能" => "2C",
        "费率45电能" => "2D",
        "费率46电能" => "2E",
        "费率47电能" => "2F",
        "费率48电能" => "30",
        "费率49电能" => "31",
        "费率50电能" => "32",
        "费率51电能" => "33",
        "费率52电能" => "34",
        "费率53电能" => "35",
        "费率54电能" => "36",
        "费率55电能" => "37",
        "费率56电能" => "38",
        "费率57电能" => "39",
        "费率58电能" => "3A",
        "费率59电能" => "3B",
        "费率60电能" => "3C",
        "费率61电能" => "3D",
        "费率62电能" => "3E",
        "费率63电能" => "3F",
        "电能数据块" => "FF"
    ];
    const DAYS_DI0 = [
        "当前" => "00",
        "上1结算日" => "01",
        "上2结算日" => "02",
        "上3结算日" => "03",
        "上4结算日" => "04",
        "上5结算日" => "05",
        "上6结算日" => "06",
        "上7结算日" => "07",
        "上8结算日" => "08",
        "上9结算日" => "09",
        "上10结算日" => "0A",
        "上11结算日" => "0B",
        "上12结算日" => "0C"
    ];
    const E_TYPE_DI2_A = [ //可以费率组合
        "组合有功" => "00",
        "正向有功" => "01",
        "反向有功" => "02",
        "组合无功1" => "03",
        "组合无功2" => "04",
        "第一象限无功" => "05",
        "第二象限无功" => "06",
        "第三象限无功" => "07",
        "第四象限无功" => "08",
        "正向视在" => "09",
        "反向视在" => "0A",
    ];
    const E_TYPE_DI2_B = [ //不可以同费率组合
        "关联总电能" => "80",
        "正向有功基波总电能" => "81",
        "反向有功基波总电能" => "82",
        "正向有功谐波总电能" => "83",
        "反向有功谐波总电能" => "84",
        "铜损有功总电能补偿量" => "85",
        "铁损有功总电能补偿量" => "86",

        "A相正向有功电能" => "15",
        "A相反向有功电能" => "16",
        "A相组合无功1电能" => "17",
        "A相组合无功2电能" => "18",
        "A相第一象限无功电能" => "19",
        "A相第二象限无功电能" => "1A",
        "A相第三象限无功电能" => "1B",
        "A相第四象限无功电能" => "1C",
        "A相正向视在电能" => "1D",
        "A相反向视在电能" => "1E",

        "A相关联电能" => "94",
        "A相正向有功基波总电能" => "95",
        "A相反向有功基波总电能" => "96",
        "A相正向有功谐波总电能" => "97",
        "A相反向有功谐波总电能" => "98",
        "A相铜损有功总电能补偿量" => "99",
        "A相铁损有功总电能补偿量" => "9A",

        "B相正向有功电能" => "20",
        "B相反向有功电能" => "2A",
        "B相组合无功1电能" => "2B",
        "B相组合无功2电能" => "2C",
        "B相第一象限无功电能" => "2D",
        "B相第二象限无功电能" => "2E",
        "B相第三象限无功电能" => "2F",
        "B相第四象限无功电能" => "30",
        "B相正向视在电能" => "31",
        "B相反向视在电能" => "32",

        "B相关联电能" => "A8",
        "B相正向有功基波总电能" => "A9",
        "B相反向有功基波总电能" => "AA",
        "B相正向有功谐波总电能" => "AB",
        "B相反向有功谐波总电能" => "AC",
        "B相铜损有功总电能补偿量" => "AD",
        "B相铁损有功总电能补偿量" => "AE",

        "C相正向有功电能" => "3D",
        "C相反向有功电能" => "3E",
        "C相组合无功1电能" => "3F",
        "C相组合无功2电能" => "40",
        "C相第一象限无功电能" => "41",
        "C相第二象限无功电能" => "42",
        "C相第三象限无功电能" => "43",
        "C相第四象限无功电能" => "44",
        "C相正向视在电能" => "45",
        "C相反向视在电能" => "46",

        "C相关联电能" => "BC",
        "C相正向有功基波总电能" => "BD",
        "C相反向有功基波总电能" => "BE",
        "C相正向有功谐波总电能" => "BF",
        "C相反向有功谐波总电能" => "C0",
        "C相铜损有功总电能补偿量" => "C1",
        "C相铁损有功总电能补偿量" => "C2",
    ];
    public function __construct($dlt645)
    {
        parent::__construct($dlt645);
    }
    /**
     * 获取各项电能数据
     * 电能类型e_type在E_TYPE_DI3_A或B中，E_TYPE_DI3_B中项目时，rate需设置位"00"
     * 费率rate在RATES_DI2中，当$rate=255组合有功电能数据库，
     * 日期day在DAYS_DI0，可获取最近13天数据
     * 
     */
    public function getMeterEnergy($e_type = '组合有功', $rate = "总电能", $day = "当前")
    {
        if (in_array($e_type, self::E_TYPE_DI2_A)) {
        } elseif (in_array($e_type, self::E_TYPE_DI2_B)) {
            $rate = self::RATES_DI1['总电能'];
        } else {
            return false;
        }
        if (!in_array($rate, self::RATES_DI1)) {
            return false;
        }
        if (!in_array($day, self::DAYS_DI0)) {
            return false;
        }
        $this->exec('11', '00', $e_type, $rate, $day);
        $energy = intval(substr($this->response->NData, 0, 6)) + intval(substr($this->response->NData, 6, 2)) / 100;
        return $energy;
    }
}
